; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_8 ?v7 ?v5)
             (pred_1 ?v4 ?v13)
             (pred_10 ?v7 ?v13)
             (pred_11 ?v1 ?v7 )
	     (pred_4 ?v7)
             (pred_5 ?v11)
             (pred_12 ?v4)
             (pred_7 ?v13)
             (pred_2 ?v7)
             (pred_6 ?v4)
             (pred_3 ?v7)
             (pred_9 ))



(:action op_2
:parameters (?v8 ?v2 ?v6 ?v12)
:precondition (and (pred_5 ?v8) (pred_5 ?v2) (pred_12 ?v6) (pred_7 ?v12)
          (pred_8 ?v8 ?v2) (pred_1 ?v6 ?v12)
                   (pred_10 ?v2 ?v12) (pred_4 ?v8) 
                   (pred_2 ?v2) (pred_6 ?v6))
:effect (and  (pred_3 ?v2) (not (pred_2 ?v2))))


(:action op_1
:parameters (?v8 ?v9)
:precondition (and (pred_5 ?v8) (pred_5 ?v9)
               (pred_4 ?v8) (pred_8 ?v8 ?v9) (pred_3 ?v9))
:effect (and (pred_4 ?v9) (not (pred_4 ?v8))))

(:action op_5
:parameters (?v8 ?v6)
:precondition (and (pred_5 ?v8) (pred_12 ?v6) 
                  (pred_4 ?v8) (pred_11 ?v6 ?v8) (pred_9 ))
:effect (and (pred_6 ?v6)
   (not (pred_11 ?v6 ?v8)) (not (pred_9 ))))


(:action op_3
:parameters (?v8 ?v10 ?v3)
:precondition (and (pred_5 ?v8) (pred_12 ?v10) (pred_12 ?v3)
                  (pred_4 ?v8) (pred_6 ?v3) (pred_11 ?v10 ?v8))
:effect (and (pred_6 ?v10) (pred_11 ?v3 ?v8)
        (not (pred_6 ?v3)) (not (pred_11 ?v10 ?v8))))

(:action op_4
:parameters (?v8 ?v6)
:precondition (and (pred_5 ?v8) (pred_12 ?v6) 
                  (pred_4 ?v8) (pred_6 ?v6))
:effect (and (pred_9 ) (pred_11 ?v6 ?v8) (not (pred_6 ?v6)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_02 obj_21 obj_22 obj_13 obj_08 obj_23 obj_17 obj_27 obj_19 obj_01 obj_12 obj_09 obj_15 obj_29 obj_03 obj_05 obj_18 obj_07 obj_25 obj_26 obj_28 obj_16 obj_31 obj_10 obj_24
    obj_14 obj_11 obj_30
    obj_04 obj_06 obj_20
    )

    (:init
       (pred_9)

       (pred_5 obj_02)
       (pred_5 obj_21)
       (pred_5 obj_22)
       (pred_5 obj_13)
       (pred_5 obj_08)
       (pred_5 obj_23)
       (pred_5 obj_17)
       (pred_5 obj_27)
       (pred_5 obj_19)
       (pred_5 obj_01)
       (pred_5 obj_12)
       (pred_5 obj_09)
       (pred_5 obj_15)
       (pred_5 obj_29)
       (pred_5 obj_03)
       (pred_5 obj_05)
       (pred_5 obj_18)
       (pred_5 obj_07)
       (pred_5 obj_25)
       (pred_5 obj_26)
       (pred_5 obj_28)
       (pred_5 obj_16)
       (pred_5 obj_31)
       (pred_5 obj_10)
       (pred_5 obj_24)
       (pred_7 obj_14)
       (pred_7 obj_11)
       (pred_7 obj_30)
       (pred_12 obj_04)
       (pred_12 obj_06)
       (pred_12 obj_20)

       (pred_8 obj_02 obj_23)
       (pred_8 obj_02 obj_21)
       (pred_8 obj_21 obj_17)
       (pred_8 obj_21 obj_22)
       (pred_8 obj_21 obj_02)
       (pred_8 obj_22 obj_27)
       (pred_8 obj_22 obj_13)
       (pred_8 obj_22 obj_21)
       (pred_8 obj_13 obj_19)
       (pred_8 obj_13 obj_08)
       (pred_8 obj_13 obj_22)
       (pred_8 obj_08 obj_01)
       (pred_8 obj_08 obj_13)
       (pred_8 obj_23 obj_12)
       (pred_8 obj_23 obj_17)
       (pred_8 obj_23 obj_02)
       (pred_8 obj_17 obj_09)
       (pred_8 obj_17 obj_27)
       (pred_8 obj_17 obj_21)
       (pred_8 obj_17 obj_23)
       (pred_8 obj_27 obj_15)
       (pred_8 obj_27 obj_19)
       (pred_8 obj_27 obj_22)
       (pred_8 obj_27 obj_17)
       (pred_8 obj_19 obj_29)
       (pred_8 obj_19 obj_01)
       (pred_8 obj_19 obj_13)
       (pred_8 obj_19 obj_27)
       (pred_8 obj_01 obj_03)
       (pred_8 obj_01 obj_08)
       (pred_8 obj_01 obj_19)
       (pred_8 obj_12 obj_05)
       (pred_8 obj_12 obj_09)
       (pred_8 obj_12 obj_23)
       (pred_8 obj_09 obj_18)
       (pred_8 obj_09 obj_15)
       (pred_8 obj_09 obj_17)
       (pred_8 obj_09 obj_12)
       (pred_8 obj_15 obj_07)
       (pred_8 obj_15 obj_29)
       (pred_8 obj_15 obj_27)
       (pred_8 obj_15 obj_09)
       (pred_8 obj_29 obj_25)
       (pred_8 obj_29 obj_03)
       (pred_8 obj_29 obj_19)
       (pred_8 obj_29 obj_15)
       (pred_8 obj_03 obj_26)
       (pred_8 obj_03 obj_01)
       (pred_8 obj_03 obj_29)
       (pred_8 obj_05 obj_28)
       (pred_8 obj_05 obj_18)
       (pred_8 obj_05 obj_12)
       (pred_8 obj_18 obj_16)
       (pred_8 obj_18 obj_07)
       (pred_8 obj_18 obj_09)
       (pred_8 obj_18 obj_05)
       (pred_8 obj_07 obj_31)
       (pred_8 obj_07 obj_25)
       (pred_8 obj_07 obj_15)
       (pred_8 obj_07 obj_18)
       (pred_8 obj_25 obj_10)
       (pred_8 obj_25 obj_26)
       (pred_8 obj_25 obj_29)
       (pred_8 obj_25 obj_07)
       (pred_8 obj_26 obj_24)
       (pred_8 obj_26 obj_03)
       (pred_8 obj_26 obj_25)
       (pred_8 obj_28 obj_16)
       (pred_8 obj_28 obj_05)
       (pred_8 obj_16 obj_31)
       (pred_8 obj_16 obj_18)
       (pred_8 obj_16 obj_28)
       (pred_8 obj_31 obj_10)
       (pred_8 obj_31 obj_07)
       (pred_8 obj_31 obj_16)
       (pred_8 obj_10 obj_24)
       (pred_8 obj_10 obj_25)
       (pred_8 obj_10 obj_31)
       (pred_8 obj_24 obj_26)
       (pred_8 obj_24 obj_10)
       (pred_2 obj_17)
       (pred_2 obj_01)
       (pred_2 obj_25)
       (pred_10  obj_17 obj_14)
       (pred_10  obj_01 obj_11)
       (pred_10  obj_25 obj_30)
       (pred_3 obj_02)
       (pred_3 obj_21)
       (pred_3 obj_22)
       (pred_3 obj_13)
       (pred_3 obj_08)
       (pred_3 obj_23)
       (pred_3 obj_27)
       (pred_3 obj_19)
       (pred_3 obj_12)
       (pred_3 obj_09)
       (pred_3 obj_15)
       (pred_3 obj_29)
       (pred_3 obj_03)
       (pred_3 obj_05)
       (pred_3 obj_18)
       (pred_3 obj_07)
       (pred_3 obj_26)
       (pred_3 obj_28)
       (pred_3 obj_16)
       (pred_3 obj_31)
       (pred_3 obj_10)
       (pred_3 obj_24)

       (pred_1  obj_04 obj_14)
       (pred_1  obj_06 obj_11)
       (pred_1  obj_20 obj_30)
       (pred_11 obj_04 obj_31)
       (pred_11 obj_06 obj_21)
       (pred_11 obj_20 obj_19)
       (pred_4 obj_12)
    )

    (:goal (and
       (pred_11 obj_06 obj_31)
    ))
(:constraints
  (always (not (pred_4 obj_15)))
)
)

; plan
1. (op_1 obj_12 obj_23)
   deleted: (pred_4 obj_12)
   added: (pred_4 obj_23)
   goals met: 0 of 1
2. (op_1 obj_23 obj_02)
   deleted: (pred_4 obj_23)
   added: (pred_4 obj_02)
   goals met: 0 of 1
3. (op_1 obj_02 obj_21)
   deleted: (pred_4 obj_02)
   added: (pred_4 obj_21)
   goals met: 0 of 1
4. (op_5 obj_21 obj_06)
   deleted: (pred_11 obj_06 obj_21) (pred_9)
   added: (pred_6 obj_06)
   goals met: 0 of 1
5. (op_1 obj_21 obj_22)
   deleted: (pred_4 obj_21)
   added: (pred_4 obj_22)
   goals met: 0 of 1
6. (op_1 obj_22 obj_27)
   deleted: (pred_4 obj_22)
   added: (pred_4 obj_27)
   goals met: 0 of 1
7. (op_1 obj_27 obj_19)
   deleted: (pred_4 obj_27)
   added: (pred_4 obj_19)
   goals met: 0 of 1
8. (op_1 obj_19 obj_29)
   deleted: (pred_4 obj_19)
   added: (pred_4 obj_29)
   goals met: 0 of 1
9. (op_1 obj_29 obj_03)
   deleted: (pred_4 obj_29)
   added: (pred_4 obj_03)
   goals met: 0 of 1
10. (op_1 obj_03 obj_26)
   deleted: (pred_4 obj_03)
   added: (pred_4 obj_26)
   goals met: 0 of 1
11. (op_1 obj_26 obj_24)
   deleted: (pred_4 obj_26)
   added: (pred_4 obj_24)
   goals met: 0 of 1
12. (op_1 obj_24 obj_10)
   deleted: (pred_4 obj_24)
   added: (pred_4 obj_10)
   goals met: 0 of 1
13. (op_1 obj_10 obj_31)
   deleted: (pred_4 obj_10)
   added: (pred_4 obj_31)
   goals met: 0 of 1
14. (op_3 obj_31 obj_04 obj_06)
   deleted: (pred_6 obj_06) (pred_11 obj_04 obj_31)
   added: (pred_6 obj_04) (pred_11 obj_06 obj_31)
   goals met: 1 of 1
